In [1]:
import pandas as pd

In [25]:
Ex1 ={
    'Nomes':['Alice','Julia','Bruna','Daniel','Filipe','Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissões':['Direito','Engenharia','Enfermagem','Engenheiro Civil','Cientista da Computação', 'Engenheiro Eletrônico'],
    'ID':[1,2,3,4,5,6]
}

Ex2= {
    'Número de Produtos Fabricados': [50,30,40,100],
    'Setores': [1,2,3,4]
}

In [29]:
df1=pd.DataFrame(Ex1)

In [30]:
df1.head(6)

    Nomes  Idade               Profissões  ID
0   Alice     19                  Direito   1
1   Julia     22               Engenharia   2
2   Bruna     28               Enfermagem   3
3  Daniel     34         Engenheiro Civil   4
4  Filipe     28  Cientista da Computação   5
5  Silvio     48    Engenheiro Eletrônico   6

In [31]:
df2=pd.DataFrame(Ex2)

In [32]:
df2.head()

   Número de Produtos Fabricados  Setores
0                             50        1
1                             30        2
2                             40        3
3                            100        4

In [38]:
#Ex3 
p1= {
    'ID': [1,2,3,4],
    'Nome':['Ana','Pedro','Maria', 'João'],
    'Setores':['RH','Vendas','Administrativo','Produção']
}

p2= {
    'ID':[1,2,3,4],
    'Salários':[3000,2800,3200,2500]
}

In [42]:
df3=pd.DataFrame(p1)

In [43]:
df4=pd.DataFrame(p2)

In [44]:
df_n2 = pd.merge(df3,df4,how='inner',on='ID')

In [45]:
df_n2.head()

   ID   Nome         Setores  Salários
0   1    Ana              RH      3000
1   2  Pedro          Vendas      2800
2   3  Maria  Administrativo      3200
3   4   João        Produção      2500